; domain
(define (domain knights-and-pawns)
    (:requirements :typing :negative-preconditions :equality :disjunctive-preconditions)
    (:types
        figure - object
        location - object

        pawn knight bishop rook queen king - figure
        white black - color

        pawn_w   pawn_b   - pawn  
        knight_w knight_b - knight
        bishop_w bishop_b - bishop
        rook_w   rook_b   - rook  
        queen_w  queen_b  - queen 
        king_w   king_b   - king  

        pawn_w knight_w bishop_w rook_w queen_w king_w - white
        pawn_b knight_b bishop_b rook_b queen_b king_b - black
    )
    (:predicates
        (at ?figure - figure ?file ?rank - location)
        (diff_by_Zero ?file ?rank - location)
        (diff_by_One ?file ?rank - location)
        (diff_by_Two ?file ?rank - location)
        (diff_by_Three ?file ?rank - location)
        (diff_by_Four ?file ?rank - location)
        (diff_by_Five ?file ?rank - location)
        (diff_by_Six ?file ?rank - location)
        (diff_by_Seven ?file ?rank - location)
        (diff_by_Eight ?file ?rank - location)
        (diff_by_N ?file ?rank - location)
        (plusOne_white ?file ?rank - location)
        (plusOne_black ?file ?rank - location)
        (pawn_double_white ?from_file ?to_file ?from_rank ?to_rank - location)
        (pawn_double_black ?from_file ?to_file ?from_rank ?to_rank - location)
    )

    (:action pawn_move_white
        :parameters (?pawn - pawn_w ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and 
                           (at ?pawn ?from_file ?from_rank)
                           (or    
                               (and ;single move:
                                   (diff_by_Zero ?from_file ?to_file) ; file +/- 0
                                   (plusOne_white ?from_rank ?to_rank) ; rank +1
                               )
                               (and ;double move:
                                   (pawn_double_white ?from_file ?to_file ?from_rank ?to_rank)
                               )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                      )
        :effect (and (not (at ?pawn ?from_file ?from_rank))
                     (at ?pawn ?to_file ?to_rank)
                )
    )

    (:action pawn_move_black
        :parameters (?pawn - pawn_b ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and 
                           (at ?pawn ?from_file ?from_rank)
                           (or    
                               (and ;single move:
                                   (diff_by_Zero ?from_file ?to_file) ; file +/- 0
                                   (plusOne_black ?from_rank ?to_rank) ; rank +1
                               )
                               (and ;double move:
                                   (pawn_double_black ?from_file ?to_file ?from_rank ?to_rank)
                               )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                      )
        :effect (and (not (at ?pawn ?from_file ?from_rank))
                     (at ?pawn ?to_file ?to_rank)
                )
    )

    (:action knight_move
        :parameters (?knight - knight ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and (at ?knight ?from_file ?from_rank)
                           (or
                               (and ;two files, one row:
                                   (diff_by_Two ?from_file ?to_file) ; file +/- 2
                                   (diff_by_One ?from_rank ?to_rank) ; rank +/- 1
                               )
                               (and ;two rows, one file:
                                   (diff_by_Two ?from_rank ?to_rank) ; rank +/- 2
                                   (diff_by_One ?from_file ?to_file) ; file +/- 1
                               )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                      )
        :effect (and (not (at ?knight ?from_file ?from_rank))
                     (at ?knight ?to_file ?to_rank)
                )
    )

    (:action bishop_move
        :parameters (?bishop - bishop ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and (at ?bishop ?from_file ?from_rank)
                           ;diagonal moves (possibilities are "move 1 diagonally" up to "move n diagonally"):
                           (or
							   (and (diff_by_One ?from_file ?to_file) ;file +/-1
							        (diff_by_One ?from_rank ?to_rank) ;rank +/-1
							   )
							   (and (diff_by_Two ?from_file ?to_file) ;file +/-2
							        (diff_by_Two ?from_rank ?to_rank) ;rank +/-2
							   )
							   (and (diff_by_Three ?from_file ?to_file) ;file +/-3
							        (diff_by_Three ?from_rank ?to_rank) ;rank +/-3
							   )
							   (and (diff_by_Four ?from_file ?to_file) ;file +/-4
							        (diff_by_Four ?from_rank ?to_rank) ;rank +/-4
							   )
							   (and (diff_by_Five ?from_file ?to_file) ;file +/-5
							        (diff_by_Five ?from_rank ?to_rank) ;rank +/-5
							   )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                       )
        :effect (and (not (at ?bishop ?from_file ?from_rank))
                     (at ?bishop ?to_file ?to_rank)
                )
    )

    (:action rook_move
        :parameters (?rook - rook ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and (at ?rook ?from_file ?from_rank)
                           (or
                               (and ;vertical movement:
                                   (diff_by_Zero ?from_file ?to_file) ; file +/-0
                                   (diff_by_N ?from_rank ?to_rank) ; rank +/-n
                               )
                               (and ;horizontal movement:
                                   (diff_by_Zero ?from_rank ?to_rank) ; rank +/-0
                                   (diff_by_N ?from_file ?to_file) ; file +/-n
                               )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                       )
        :effect (and (not (at ?rook ?from_file ?from_rank))
                     (at ?rook ?to_file ?to_rank)
                )
    )

    (:action queen_move
        :parameters (?queen - queen ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and (at ?queen ?from_file ?from_rank)
                           (or
                               ;diagonal moves (same as bishop moves):
                               (or
								   (and (diff_by_One ?from_file ?to_file) ;file +/-1
								        (diff_by_One ?from_rank ?to_rank) ;rank +/-1
								   )
								   (and (diff_by_Two ?from_file ?to_file) ;file +/-2
								        (diff_by_Two ?from_rank ?to_rank) ;rank +/-2
								   )
								   (and (diff_by_Three ?from_file ?to_file) ;file +/-3
								        (diff_by_Three ?from_rank ?to_rank) ;rank +/-3
								   )
								   (and (diff_by_Four ?from_file ?to_file) ;file +/-4
								        (diff_by_Four ?from_rank ?to_rank) ;rank +/-4
								   )
								   (and (diff_by_Five ?from_file ?to_file) ;file +/-5
								        (diff_by_Five ?from_rank ?to_rank) ;rank +/-5
								   )
                               )
                               ;horizontal & diagonal moves (same as rook moves):
                               (and ;vertical movement:
                                   (diff_by_Zero ?from_file ?to_file) ; file +/-0
                                   (diff_by_N ?from_rank ?to_rank) ; rank +/-n
                               )
                               (and ;horizontal movement:
                                   (diff_by_Zero ?from_rank ?to_rank) ; rank +/-0
                                   (diff_by_N ?from_file ?to_file) ; file +/-n
                               )
                           )
                           ;(not (at ?figure ?to_file ?to_rank))
                       )
        :effect (and (not (at ?queen ?from_file ?from_rank))
                     (at ?queen ?to_file ?to_rank)
                )
    )
    
    (:action king_move
        :parameters (?king - king ?from_file ?from_rank ?to_file ?to_rank - location); ?figure - figure)
        :precondition (and (at ?king ?from_file ?from_rank)
                           (diff_by_One ?from_file ?to_file) ; file +/-1
                           (diff_by_One ?from_rank ?to_rank) ; rank +/-1
                           ;(not (at ?figure ?to_file ?to_rank))
                       )
        :effect (and (not (at ?king ?from_file ?from_rank))
                     (at ?king ?to_file ?to_rank)
                )
    )
)

; problem
(define (problem knights-and-pawns-problem)
    (:domain knights-and-pawns)
    (:objects
        n1 n2 n3 n4 n5 - location
    	;white pieces:
        knight_w1 knight_w2 - knight_w
        pawn_w1 pawn_w2 pawn_w3 pawn_w4 pawn_w5 - pawn_w
        king_w1 - king_w
        rook_w1 rook_w2 - rook_w
        w_bishop_w1 b_bishop_w1 - bishop_w
        queen_w1 - queen_w
    	;black pieces:
    	knight_b1 knight_b2 - knight_b
        pawn_b1 pawn_b2 pawn_b3 pawn_b4 pawn_b5 - pawn_b
    	king_b1 - king_b
        rook_b1 rook_b2 - rook_b
        w_bishop_b1 b_bishop_b1 - bishop_b
        queen_b1 - queen_b
    )
    (:init
        ;Initial position of the Knight piece (upper left corner) => (n1 n8) = A8  // (at pawn_w1 n1 n2) = A2
		(at pawn_b1 n5 n4)
		(at pawn_w1 n1 n2)
		(at pawn_w2 n2 n2)
		(at pawn_w3 n3 n2)
		(at pawn_w4 n4 n2)
		(at pawn_w5 n5 n2)
		(at rook_w1 n1 n1)
		(at queen_w1 n2 n1)
		(at king_w1 n3 n1)
		(at knight_w1 n4 n1)
		(at w_bishop_w1 n5 n1)

		;Difference by Zero:
		(diff_by_Zero n1 n1)
		(diff_by_Zero n2 n2)
		(diff_by_Zero n3 n3)
		(diff_by_Zero n4 n4)
		(diff_by_Zero n5 n5)

		;Difference by One:
		(diff_by_One n1 n2)
		(diff_by_One n2 n1)
		(diff_by_One n2 n3)
		(diff_by_One n3 n2)
		(diff_by_One n3 n4)
		(diff_by_One n4 n3)
		(diff_by_One n4 n5)
		(diff_by_One n5 n4)

		;Difference by Two:
		(diff_by_Two n1 n3)
		(diff_by_Two n2 n4)
		(diff_by_Two n3 n1)
		(diff_by_Two n3 n5)
		(diff_by_Two n4 n2)
		(diff_by_Two n5 n3)

		;Difference by Three:
		(diff_by_Three n1 n4)
		(diff_by_Three n2 n5)
		(diff_by_Three n4 n1)
		(diff_by_Three n5 n2)

		;Difference by Four:
		(diff_by_Four n1 n5)
		(diff_by_Four n5 n1)

		;Difference by Five:

		;Difference by Six:

		;Difference by Seven:

		;Diff by Zero:
		(diff_by_N n1 n1)
		(diff_by_N n2 n2)
		(diff_by_N n3 n3)
		(diff_by_N n4 n4)
		(diff_by_N n5 n5)

		;Diff by One:
		(diff_by_N n1 n2)
		(diff_by_N n2 n1)
		(diff_by_N n2 n3)
		(diff_by_N n3 n2)
		(diff_by_N n3 n4)
		(diff_by_N n4 n3)
		(diff_by_N n4 n5)
		(diff_by_N n5 n4)

		;Diff by Two:
		(diff_by_N n1 n3)
		(diff_by_N n2 n4)
		(diff_by_N n3 n1)
		(diff_by_N n3 n5)
		(diff_by_N n4 n2)
		(diff_by_N n5 n3)

		;Diff by Three:
		(diff_by_N n1 n4)
		(diff_by_N n2 n5)
		(diff_by_N n4 n1)
		(diff_by_N n5 n2)

		;Diff by Four:
		(diff_by_N n1 n5)
		(diff_by_N n5 n1)

		;Pawn double moves for white:
		(pawn_double_white n1 n1 n2 n4)
		(pawn_double_white n2 n2 n2 n4)
		(pawn_double_white n3 n3 n2 n4)
		(pawn_double_white n4 n4 n2 n4)
		(pawn_double_white n5 n5 n2 n4)

		;Pawn double moves for black:
		(pawn_double_black n1 n1 n4 n2)
		(pawn_double_black n2 n2 n4 n2)
		(pawn_double_black n3 n3 n4 n2)
		(pawn_double_black n4 n4 n4 n2)
		(pawn_double_black n5 n5 n4 n2)

		;Pawn single moves for white:
		(plusOne_white n1 n2)
		(plusOne_white n2 n3)
		(plusOne_white n3 n4)
		(plusOne_white n4 n5)

		;Pawn single moves for black:
		(plusOne_black n2 n1)
		(plusOne_black n3 n2)
		(plusOne_black n4 n3)
		(plusOne_black n5 n4)
    )
    (:goal (and
        ;Adjust numbers by hand!
;[:goal_position]
        (at pawn_w3 n3 n5)
		(at pawn_w2 n2 n3)
		(at knight_w1 n3 n3)
		(at pawn_w4 n4 n3)
		(at pawn_w1 n1 n2)
		(at pawn_w5 n5 n2)
		(at rook_w1 n4 n1)
		(at king_w1 n5 n1)
		(at w_bishop_w1 n1 n5)
		(at queen_w1 n5 n4)
		
		(at pawn_b1 n5 n3)
           )
    )
)

; plan
1. (bishop_move w_bishop_w1 n5 n1 n1 n5)
   deleted: (at w_bishop_w1 n5 n1)
   added: (at w_bishop_w1 n1 n5)
   goals met: 3 of 11
2. (knight_move knight_w1 n4 n1 n3 n3)
   deleted: (at knight_w1 n4 n1)
   added: (at knight_w1 n3 n3)
   goals met: 4 of 11
3. (rook_move rook_w1 n1 n1 n4 n1)
   deleted: (at rook_w1 n1 n1)
   added: (at rook_w1 n4 n1)
   goals met: 5 of 11
4. (pawn_move_white pawn_w3 n3 n2 n3 n4)
   deleted: (at pawn_w3 n3 n2)
   added: (at pawn_w3 n3 n4)
   goals met: 5 of 11
5. (pawn_move_white pawn_w3 n3 n4 n3 n5)
   deleted: (at pawn_w3 n3 n4)
   added: (at pawn_w3 n3 n5)
   goals met: 6 of 11
6. (pawn_move_black pawn_b1 n5 n4 n5 n3)
   deleted: (at pawn_b1 n5 n4)
   added: (at pawn_b1 n5 n3)
   goals met: 7 of 11
7. (queen_move queen_w1 n2 n1 n5 n4)
   deleted: (at queen_w1 n2 n1)
   added: (at queen_w1 n5 n4)
   goals met: 8 of 11
8. (pawn_move_white pawn_w4 n4 n2 n4 n3)
   deleted: (at pawn_w4 n4 n2)
   added: (at pawn_w4 n4 n3)
   goals met: 9 of 11
9. (king_move king_w1 n3 n1 n4 n2)
   deleted: (at king_w1 n3 n1)
   added: (at king_w1 n4 n2)
   goals met: 9 of 11
10. (king_move king_w1 n4 n2 n5 n1)
   deleted: (at king_w1 n4 n2)
   added: (at king_w1 n5 n1)
   goals met: 10 of 11
11. (pawn_move_white pawn_w2 n2 n2 n2 n3)
   deleted: (at pawn_w2 n2 n2)
   added: (at pawn_w2 n2 n3)
   goals met: 11 of 11
